In [8]:
import numpy as np

In [9]:
import pandas as pd

In [10]:
from pandas import Series,DataFrame

# Missing Values

In [11]:
a=Series(['One','Two',np.NaN,'Four',np.NaN])             #index generated automnatically

In [12]:
a

0     One
1     Two
2     NaN
3    Four
4     NaN
dtype: object

In [13]:
pd.isnull(a)

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [14]:
pd.notnull(a)

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [15]:
a.isnull().sum()          #Checking for how many null values

2

In [16]:
a.dropna()

0     One
1     Two
3    Four
dtype: object

In [17]:
b=DataFrame({'Fri':[1,3],'Thurs':[2,4]},index=['a','b'])x

SyntaxError: invalid syntax (228273856.py, line 1)

In [18]:
b

NameError: name 'b' is not defined

In [19]:
c=DataFrame({'C1':[1,2],'C2':[3,4],'C3':[5,6]},index=['a','b'])

In [20]:
c

   C1  C2  C3
a   1   3   5
b   2   4   6

In [21]:
d=DataFrame([[1,2,3],[np.NaN,5,6],[7,np.NaN,8],[np.NaN,np.NaN,np.NaN]])         #Creating a Dataframe without assigning columns and rows...directly assigning as a list collection

In [22]:
d

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0
3  NaN  NaN  NaN

In [23]:
d.dropna()

     0    1    2
0  1.0  2.0  3.0

In [24]:
d.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [25]:
d.dropna(axis=1)                 #Axis=1...means applicable for column

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]